package postgraduate.leetcd.ms;

/** 携程-20220414-第二题
 * 题目描述
 * 游游拿到了一个数组,其期一些数被染成红色,些数被染成蓝色。游游想知道,取两个不同颜色的数，且它们的数值相等,有多少种不同的取法?
 * 我们定义，两种取法如果取的某个数在原数组的位置不同,则定义为不同的取法。
 * 输入描述:
 * 第一行输入一个正整数n，代表数组的长度。第二行输入n个正整数ai，代表数组中的元素。
 * 第三行输入一个长度为n,仅包含'R’和'B’两种字符的字符串,第i个字符为'R'代表数组第i个元素被染成红色，为'B'代表被染成蓝色。
 *
 * 1 <= n <= 200000
 * 1<= a <= 10^9
 * 输出描述:
 * 5
 * 1 2 1 2 2
 * BRRBB
 * 输出
 * 3
 * 说明
 * 第一种取法,取第一个数和第三个数,颜色不同且都是1。
 * 第二种取法,取第二个数和第四个数,颜色不同且都是2。
 * 第三种取法,取第二个数和第五个数,颜色不同且都是2。
 */
public class XC_RanQiuQuSe {
}
